{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Establish a connection with our Neptune gremlin endpoint"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "from __future__  import print_function  # Python 2/3 compatibility\n",
    "\n",
    "from gremlin_python import statics\n",
    "from gremlin_python.structure.graph import Graph\n",
    "from gremlin_python.process.graph_traversal import __\n",
    "from gremlin_python.process.traversal import T\n",
    "from gremlin_python.process.strategies import *\n",
    "from gremlin_python.driver.driver_remote_connection import DriverRemoteConnection\n",
    "\n",
    "statics.load_statics(globals())\n",
    "\n",
    "graph = Graph()\n",
    "g = graph.traversal().withRemote(DriverRemoteConnection('ws://neptunedbcluster-umztptccpt2t.cluster-ct6mcfcdqyrw.us-east-1.neptune.amazonaws.com:8182/gremlin','g'))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Define some helper functions for gremlin operations"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "def findCustomer(name):\n",
    "    return g.V().hasLabel('customer').has('name', name).valueMap(True).toList()[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "def findProduct(title):\n",
    "    return g.V().hasLabel('product').has('product_title', title).valueMap(True).toList()[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "def addReview(customer, product, rating):\n",
    "    fromId = customer[T.id]\n",
    "    toId = product[T.id]\n",
    "    return g.V(fromId).addE('review').to(g.V(toId)).property('star_rating', rating).toList()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "def recommend_products(customer_id):\n",
    "    return g.V(customer_id).as_('Target').\\\n",
    "    sideEffect(out('review').store('ProductsTargetAlreadyReviewed')).\\\n",
    "    outE('review').has('star_rating', 5).inV().\\\n",
    "    inE('review').has('star_rating', 5).outV().\\\n",
    "    where(neq('Target')).\\\n",
    "    outE('review').has('star_rating', 5).inV().\\\n",
    "    where(without('ProductsTargetAlreadyReviewed')).\\\n",
    "    dedup().\\\n",
    "    values('product_title').\\\n",
    "    toList()\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Find and query some pre-existing demo customers added out-of-band"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "gabe = findCustomer('gabe')\n",
    "cam = findCustomer('cam')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['CS Go']"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "recommend_products(gabe[T.id])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Count products, customers, and reviews"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[65845]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# How many products?\n",
    "g.V().hasLabel('product').count().toList()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[1045775]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# How many customers?\n",
    "g.V().hasLabel('customer').count().toList()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[1786052]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# How many reviews?\n",
    "g.E().hasLabel('review').count().toList()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Fetch product recommendations from the full imported reviews dataset for a customer with lots of reviews "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Mortal Kombat Advance',\n",
       " 'The Suffering',\n",
       " 'Super Mario World: Super Mario Advance 2',\n",
       " 'F-Zero: Maximum Velocity',\n",
       " 'WCW/NWO Revenge',\n",
       " 'Dragon Warrior III',\n",
       " 'Dragon Warrior III',\n",
       " 'Project Gotham Racing',\n",
       " 'Playstation 2 Console - Black',\n",
       " \"Tony Hawk's Pro Skater 2\",\n",
       " 'Saturday Night Slammasters',\n",
       " 'Half-Life 2: Episode One',\n",
       " 'Teenage Mutant Ninja Turtles III: The Manhattan Project',\n",
       " 'God of War - PlayStation 2',\n",
       " 'Advance Wars',\n",
       " 'Double Dragon II: The Revenge',\n",
       " 'Super Mario Advance',\n",
       " 'Super NES System',\n",
       " 'Super Mario Bros. 3',\n",
       " 'Star Wars - Episode I - Racer',\n",
       " 'XCOM: Enemy Unknown',\n",
       " \"Spider-Man: Mysterio's Menace\",\n",
       " 'WCW vs. NWO: WorldTour',\n",
       " 'Half-Life - PC',\n",
       " 'Teenage Mutant Ninja Turtles III, The Manhattan Project',\n",
       " 'Sonic Mega Collection',\n",
       " 'Elder Scrolls III: Morrowind',\n",
       " 'Grand Theft Auto: Vice City (Jewel Case)',\n",
       " 'Half-Life 2: Episode Pack - PC',\n",
       " \"Tony Hawk's Pro Skater 2 - PC\",\n",
       " 'RF Switch/RF Modulator',\n",
       " 'Mortal Kombat Trilogy',\n",
       " 'Mortal Kombat Trilogy',\n",
       " 'Super Mario Land 2: 6 Golden Coins',\n",
       " 'The Legend of Zelda',\n",
       " 'NFL Fever 2002',\n",
       " 'LEGO Creator (Jewel Case) - PC',\n",
       " 'Alpha Protocol',\n",
       " 'Double Dragon II',\n",
       " 'Metroid Fusion',\n",
       " 'High Rez Pack',\n",
       " 'Final Fantasy Legend 2',\n",
       " 'Controller- Jet (Black) - Gamecube',\n",
       " 'Illusion of Gaia',\n",
       " 'Contra III: The Alien Wars',\n",
       " 'Dragon Warrior',\n",
       " 'Shatter Hand - Nintendo NES',\n",
       " 'Sim City',\n",
       " 'Wario Land 4',\n",
       " 'Half Life 1 (Jewel Case) - PC',\n",
       " 'Sonic Advance',\n",
       " 'Half-Life 2 - PC',\n",
       " 'Dino Crisis',\n",
       " 'Dino Crisis',\n",
       " 'Roller Coaster Tycoon',\n",
       " 'WWF King of the Ring (Game Boy, 1993)',\n",
       " 'WWF Raw',\n",
       " 'Batman: Return of the Joker',\n",
       " 'The Binding of Isaac - Unholy Edition (PC CD) (UK IMPORT)',\n",
       " \"Castlevania II: Belmont's Revenge\",\n",
       " 'WWE Smackdown vs Raw 2011',\n",
       " \"Demon's Souls\",\n",
       " 'Super Mario 64',\n",
       " 'Super Nintendo Super Castlevania IV',\n",
       " 'Grand Theft Auto: Vice City - PC',\n",
       " 'Zelda II: The Adventure of Link',\n",
       " 'Super Punch-Out!!',\n",
       " 'Vegas Stakes',\n",
       " 'Half Life 2',\n",
       " 'GameCube Controller (Indigo / Clear)',\n",
       " \"Tom Clancy's Rainbow Six\",\n",
       " 'Nintendo Game Boy Advance - White',\n",
       " \"Tony Hawk's Pro Skater 3\",\n",
       " 'Kid Icarus',\n",
       " 'Shadowgate - Nintendo NES',\n",
       " 'Super Mario Kart',\n",
       " 'Fat Princess: Fistful of Cake - Sony PSP',\n",
       " 'Nintendo 64 Expansion Pak',\n",
       " 'Evil Dead: Regeneration',\n",
       " 'Tony Hawk Pro Skater 2',\n",
       " 'Final Fantasy Legend',\n",
       " 'Doom 2 (Jewel Case) - PC',\n",
       " \"Castlevania III: Dracula's Curse\",\n",
       " 'Barbie Groovy Games',\n",
       " 'The Powerpuff Girls: Him & Seek',\n",
       " 'Polly Pocket: Super Splash Island',\n",
       " 'Ultimate Spiderman',\n",
       " 'Batman: The Video Game',\n",
       " 'Batman Returns - Sega Genesis',\n",
       " 'Jurassic Park',\n",
       " 'The Adventures of Batman & Robin',\n",
       " 'Beauty and the Beast: Roar of the Beast',\n",
       " 'Turok: Evolution',\n",
       " 'Turok: Evolution',\n",
       " 'Turok: Evolution',\n",
       " 'Legend of Zelda Link Triforce Shield Video Game Vinyl Decal Cover Skin Protector for Nintendo GBA SP Gameboy Advance Game Boy',\n",
       " 'Skylanders Trap Team Bundle Edition',\n",
       " \"Disney's Aladdin\",\n",
       " 'WWF Royal Rumble',\n",
       " 'Kid Icarus: Uprising',\n",
       " 'Shadow The Hedgehog',\n",
       " 'Game Boy Advance SP Replacement Battery Pack for GBA SP',\n",
       " 'Sonic Advance 2',\n",
       " 'Sonic Heroes',\n",
       " 'Jungle Book - Sega Genesis',\n",
       " 'eForCity Premium Vehicle Car Charger for Game Boy Advance SP/Nintendo DS',\n",
       " 'Tekken 3',\n",
       " 'Daredevil: The Man Without Fear [Game Boy Advance]',\n",
       " 'X-Men Legends II Rise of the Apocalypse',\n",
       " 'Project: Snowblind - PC',\n",
       " 'Spider-Man: The Movie - PC',\n",
       " 'NAMCO Time Crisis 3 with Guncon 2 Light Gun',\n",
       " 'Silent Scope',\n",
       " 'Time Crisis II',\n",
       " 'Super Street Fighter II- Turbo Revival',\n",
       " 'Marvel Nemesis Rise of the Imperfects - Sony PSP',\n",
       " 'Mortal Kombat: Tournament Edition',\n",
       " 'Tekken 4 - PlayStation 2',\n",
       " 'Wormlight Advance: Silver',\n",
       " 'Transporter (Grey)',\n",
       " 'Dragon Ball Z: Collectible Card Game',\n",
       " 'PlayStation 2',\n",
       " 'PSP Screen Armor',\n",
       " 'PSP Headphones with Remote Control (White)',\n",
       " 'PlayStation Portable Core (PSP 1000)',\n",
       " 'Lego Star Wars II: The Original Trilogy',\n",
       " 'Lego Star Wars II: The Original Trilogy',\n",
       " 'Lego Star Wars II: The Original Trilogy',\n",
       " 'Lego Star Wars II: The Original Trilogy',\n",
       " 'Need for Speed: Prostreet',\n",
       " 'Hot Wheels: Beat That',\n",
       " 'The Crew',\n",
       " 'Gran Turismo 4 - PlayStation 2',\n",
       " 'Charge Game Cable Xbox 360 Game 5 Feet Cable',\n",
       " 'Call of Duty: Black Ops II',\n",
       " 'Bully: Scholarship Edition',\n",
       " 'Bully: Scholarship Edition',\n",
       " 'Xbox 360 Rechargeable Controller Battery Pack',\n",
       " 'Shaun White Snowboarding',\n",
       " 'Xbox 360 Console 2009',\n",
       " 'Wii Nunchuk Controller',\n",
       " 'Xbox 360 Play & Charge Kit with Black Controller',\n",
       " 'MX vs. ATV : On The Edge - Sony PSP',\n",
       " 'Xbox 360 Live Points Card',\n",
       " 'Xbox 360 Quick Charge Kit',\n",
       " 'Grand Theft Auto V - Special Edition',\n",
       " 'Wii Remote Controller',\n",
       " 'Beaterator - Sony PSP',\n",
       " 'PSP Slim 2000 PSP 2000 PSP 3000 Psp-3000 Carrying Case (Big O Black)',\n",
       " 'Sony Computer Entertainment PSP Console',\n",
       " 'Midnight Club LA',\n",
       " 'Star Wars: X-Wing Alliance  (Jewel Case) - PC',\n",
       " 'Microsoft Flight Simulator 2004: A Century of Flight - PC',\n",
       " 'PSP Traveler Case',\n",
       " 'PlayStation Portable 2000 System - Piano Black',\n",
       " 'Hunting Unlimited 2009',\n",
       " 'FIFA Soccer 12',\n",
       " 'Kinect Joy Ride',\n",
       " 'Wii Hardware Bundle',\n",
       " 'Big League Sports for Kinect - Xbox 360',\n",
       " 'Star Wars Battlefront II',\n",
       " 'FIFA Soccer 13',\n",
       " 'Need for Speed Collectors Series - Includes Underground 1, 2 and Most Wanted (PC DVD)',\n",
       " 'Syphon Filter Dark Mirror',\n",
       " 'Dotop PSP 2000 3000 AC Wall Adapter Power Charger',\n",
       " 'Grand Theft Auto: The Trilogy (Grand Theft Auto 3 / Grand Theft Auto: Vice City / Grand Theft Auto: San Andreas)',\n",
       " 'Scarface The World Is Yours',\n",
       " 'Gen Soft Rubber Jelly Silicone Skin Cover Case for Sony PSP 3000, Black',\n",
       " \"Syphon Filter: Logan's Shadow - Sony PSP\",\n",
       " 'Septerra Core: Legacy of the Creator - PC',\n",
       " 'SONY Automatic PSP UMD Cleaner with Cleaning Fluid & Cleaning Pads',\n",
       " 'Metal Gear Solid Portable Ops - Sony PSP',\n",
       " 'Resident Evil 4 - PC',\n",
       " 'Metal Gear Solid Peace Walker',\n",
       " 'Need For Speed Carbon - Windows',\n",
       " 'Retrolink Nintendo 64 Classic USB Enabled Wired Controller for PC and MAC, Black',\n",
       " 'USB 2.0 Gamepad for PC (supports Vista) , Blue',\n",
       " 'Hitman Collection',\n",
       " 'PlayStation Portable Limited Edition Hannah Montana Entertainment Pack - Lilac',\n",
       " 'Rapala Trophies - Sony PSP',\n",
       " 'Disney Epic Mickey',\n",
       " 'PlayStation Portable Limited Edition Madden NFL 09 Entertainment Pack- Metallic Blue',\n",
       " 'PSP Portable Memory 32MB',\n",
       " 'Sonic Rivals',\n",
       " 'Xbox 360 AV Cable',\n",
       " 'G-Force',\n",
       " 'Diner Dash - Sony PSP',\n",
       " 'Just Dance 3',\n",
       " 'Rainbow Island: Evolution',\n",
       " 'Cake Mania 3 NDS',\n",
       " 'Cake Mania: Main Street - Nintendo DS',\n",
       " \"Shepherd's Crossing - Sony PSP\",\n",
       " 'LocoRoco 2 - Sony PSP',\n",
       " 'Cars Race O Rama',\n",
       " 'Hannah Montana: Rock Out the Show - Sony PSP',\n",
       " 'Medal of Honor: Heroes 2 - Sony PSP',\n",
       " 'Blur',\n",
       " 'Full Auto 2: Battlelines',\n",
       " 'Ford Racing Off Road',\n",
       " 'Insten Silicone Skin Case Compatible With Sony PSP 3000, Black',\n",
       " 'Days of Thunder - Game and Movie - Playstation 3',\n",
       " \"I'm Game 120 Games Handheld Player with 2.7-Inch Color Display\",\n",
       " 'PS3 500 GB Gran Turismo 5 Legacy Bundle',\n",
       " 'Jimmie Johnson: Anything with an Engine',\n",
       " 'NASCAR The Game 2014',\n",
       " 'PSP Super Travel Case With Pockets',\n",
       " 'Monster Jam: Urban Assault',\n",
       " \"Pirates of the Caribbean Dead Man's Chest - Sony PSP\",\n",
       " 'Sony PSP 3001 Bundle',\n",
       " 'Blazing Angels 2: Secret Missions',\n",
       " 'MotoGP 13 (PS3) (UK IMPORT)',\n",
       " 'NASCAR: Unleashed',\n",
       " 'Call of Duty: Modern Warfare 3',\n",
       " 'Family Feud 2010 Edition',\n",
       " 'Redoctane Ignition Dance Pad Dual Platform Edition',\n",
       " 'Mario Kart: Double Dash',\n",
       " \"Tony Hawk's Pro Skater 2X\",\n",
       " 'Mercenaries: Playground of Destruction - PlayStation 2',\n",
       " 'Need For Speed: Underground 2',\n",
       " 'Need For Speed: Underground 2',\n",
       " 'Need For Speed: Underground 2',\n",
       " 'Mercenaries - Xbox',\n",
       " 'Super Smash Bros Melee',\n",
       " 'NFL Street 2',\n",
       " 'NFL Street 2',\n",
       " 'Destroy All Humans',\n",
       " 'MediEvil Resurrection - Sony PSP',\n",
       " 'Kingdom of Paradise - Sony PSP',\n",
       " 'Rengoku - Sony PSP',\n",
       " 'MediEvil',\n",
       " 'Guitar Hero (Bundle with Guitar)',\n",
       " 'Ys: The Ark of Napishtim',\n",
       " 'Tokobot - Sony PSP',\n",
       " 'Black',\n",
       " 'Black',\n",
       " 'PSP Blue Plasma Skin',\n",
       " 'Tales of Symphonia - Gamecube',\n",
       " 'Fullmetal Alchemist 2: Curse of the Crimson Elixir - PlayStation 2',\n",
       " 'Socom: Fireteam Bravo - Sony PSP',\n",
       " 'Fire Emblem: The Sacred Stones',\n",
       " 'WarioWare: Twisted!',\n",
       " 'Untold Legends: Brotherhood of the Blade - Sony PSP',\n",
       " 'Zatchbell Mamodo Battles - PlayStation 2',\n",
       " 'Infected - Sony PSP',\n",
       " 'Command & Conquer: Generals - PC',\n",
       " 'Sony Borderlands 2 - Limited Edition - PlayStation Vita Bundle',\n",
       " 'The Sims 2 Seasons Expansion Pack',\n",
       " 'Injustice: Gods Among Us',\n",
       " 'Injustice: Gods Among Us',\n",
       " 'Injustice: Gods Among Us',\n",
       " 'FIFA Street 2',\n",
       " 'NFL Street 3 - Nintendo 64',\n",
       " 'NBA 2K12(Covers May Vary)',\n",
       " 'Naruto: Ultimate Ninja Heroes 2: The Phantom Fortress - Sony PSP',\n",
       " 'PlayStation Vita Starter Kit with Memory Card',\n",
       " 'PSP UMD Case',\n",
       " 'GAEMS G155 Sentry Personal Gaming Environment',\n",
       " 'Def Jam Fight For NY The Takeover - Sony PSP',\n",
       " 'Sims 4',\n",
       " 'Rock Band Unplugged - Sony PSP',\n",
       " 'PSP 2 Pack Socom: Fireteam Bravo and Syphon Filter: Dark Mirror',\n",
       " 'Tekken 6',\n",
       " 'Juiced 2: Hot Import Nights',\n",
       " 'Blitz Overtime - Sony PSP',\n",
       " 'The Sims 2 Happy Holiday Stuff',\n",
       " 'Justice League Heroes',\n",
       " 'NFL Street 2: Unleashed - Sony PSP',\n",
       " 'Need for Speed Most Wanted',\n",
       " 'CommonByte Protector Cover Crystal Clear Plastic Hard Case Shield for Sony PSP 1000',\n",
       " 'PSP USB Cable',\n",
       " 'Devil May Cry 4',\n",
       " 'Nintendo DS',\n",
       " '72 Pin Connector for NES 8 BIT Nintendo System (Bulk Packaging)',\n",
       " '3 Xtreme',\n",
       " 'Wolfenstein: The New Order',\n",
       " 'The Legend of Zelda: Skyward Sword with Music CD',\n",
       " 'Doom 3 BFG Edition',\n",
       " 'Final Fantasy VIII',\n",
       " 'Final Fantasy VIII',\n",
       " 'Kingdom Hearts: Birth by Sleep - Sony PSP',\n",
       " 'Dissidia 012 [duodecim] Final Fantasy - Sony PSP',\n",
       " 'Sony 4 GB Memory Stick PRO Duo for PSP',\n",
       " 'Dead To Rights - Xbox',\n",
       " 'Xbox 360 Console 2007',\n",
       " 'Seal Skinz Waterproof All Season Socks',\n",
       " 'Tony Hawk: Shred',\n",
       " 'Medal of Honor Heroes - Sony PSP',\n",
       " 'Turtle Beach Call of Duty: MW3 Ear Force Delta: Limited Edition Programmable Wireless 7.1 Surround Sound Gaming Headset',\n",
       " 'ModNation Racers',\n",
       " 'LittleBigPlanet Karting - Playstation 3',\n",
       " 'Advance Wars 2: Black Hole Rising',\n",
       " 'Trenro Dual PlayStation/PlayStation 2 to PC USB Controller Adapter',\n",
       " 'The Sims Superstar Expansion Pack',\n",
       " '.hack, Part 1: Infection',\n",
       " 'Lunar: Silver Star Story Complete',\n",
       " 'Lunar Legend',\n",
       " 'Metroid Prime Hunters',\n",
       " 'Final Fantasy Tactics Advance',\n",
       " \"Yoshi's Island: Super Mario Advance 3\",\n",
       " 'Kirby Nightmare in Dream Land',\n",
       " 'Rune Factory: A Fantasy Harvest Moon',\n",
       " 'Crimson Sea',\n",
       " 'Ninja Gaiden',\n",
       " 'Star Wars Jedi Knight: Jedi Academy',\n",
       " 'Star Wars Knights of the Old Republic - Xbox',\n",
       " 'Chrono Trigger',\n",
       " 'The Sims 2',\n",
       " 'Final Fantasy X-2',\n",
       " 'Urbz: Sims In The City',\n",
       " 'Urbz: Sims In The City',\n",
       " 'Theme Hospital',\n",
       " 'Theme Hospital',\n",
       " 'SimAnimals',\n",
       " 'Titanic: Adventure out of Time',\n",
       " 'Sims 2 - Nintendo DS',\n",
       " 'Grand Theft Auto: Chinatown Wars',\n",
       " 'Strikers 1945',\n",
       " 'Galactic Attack - Sega Saturn',\n",
       " 'Gradius Galaxies',\n",
       " 'Puyo Pop',\n",
       " \"Super Ghouls'n Ghosts\",\n",
       " 'Gran Turismo 3 A-spec',\n",
       " 'Ico',\n",
       " 'Game Boy Micro',\n",
       " 'Zelda II: The Adventure of Link (Classic NES Series)',\n",
       " \"Konami Collector's Series: Arcade Advanced\",\n",
       " 'Tokyo Xtreme Racer',\n",
       " 'Tokyo Xtreme Racer 3 - PlayStation 2',\n",
       " 'Metroid: Zero Mission',\n",
       " 'Astro Boy Omega Factor',\n",
       " 'Tokyo Xtreme Racer 2',\n",
       " 'Dragon Warrior VII',\n",
       " 'Bubble Bobble Old & New',\n",
       " 'R4: Ridge Racer Type 4 - PlayStation PS1',\n",
       " 'Gekioh Shooting King',\n",
       " 'Namco Ace Combat 4 Shattered Skies',\n",
       " 'Gradius III And IV -  PlayStation 2',\n",
       " 'Ray Storm - PlayStation',\n",
       " 'Power Station for Game Boy Advance',\n",
       " \"Dragon Warrior Monsters 2: Cobi's Journey - GameBoy Color\",\n",
       " 'Rez',\n",
       " 'Bangai-O - Sega Dreamcast',\n",
       " 'PS One & LCD Screen Combo',\n",
       " 'Pump It Up: Exceed Bundle PS2',\n",
       " 'Dragon Warrior Monsters',\n",
       " 'Metal Gear Solid',\n",
       " 'Metal Gear Solid',\n",
       " 'GameCube Console',\n",
       " 'Fire Emblem: Path of Radiance - Gamecube',\n",
       " 'Final Fantasy III',\n",
       " 'Fire Emblem:  Shadow Dragon - Nintendo DS',\n",
       " 'Yu-Gi-Oh!: The Sacred Cards',\n",
       " 'Yu-Gi-Oh! Worldwide Edition: Stairway to the Destined Duel',\n",
       " 'Counter-Strike: Condition Zero - PC',\n",
       " 'Final Fantasy XI: Treasures of Aht Urhgan',\n",
       " 'Final Fantasy XI: Treasures of Aht Urhgan',\n",
       " 'Nintendo 3DS Compatible with 3DS / 3DS XL / 2DS AC Adapter',\n",
       " 'Final Fantasy XI: Seekers of Adoulin - Xbox 360',\n",
       " \"Final Fantasy XI: The Vana'diel Collection 2007 - PC\",\n",
       " 'PlayStation 2X Network Adaptor',\n",
       " 'Final Fantasy XI Chains of Promathia Expansion Pack',\n",
       " 'Final Fantasy XI Chains of Promathia Expansion Pack',\n",
       " 'Breath of Fire III',\n",
       " 'Breath of Fire III',\n",
       " 'Final Fantasy XI with HDD - PlayStation 2',\n",
       " 'Final Fantasy XI Online: Wings of the Goddess Expansion Pack',\n",
       " \"Final Fantasy XI: The Vana'diel Collection 2008\",\n",
       " 'Total Annihilation: Kingdoms Expansion - The Iron Plague',\n",
       " 'Final Fantasy XI Ultimate Collection Seekers Edition - Xbox 360',\n",
       " 'Crimson Skies: High Road to Revenge',\n",
       " 'Black & White',\n",
       " 'Halo: Combat Evolved',\n",
       " 'Iridion II',\n",
       " 'Brute Force',\n",
       " \"Tom Clancy's Splinter Cell Pandora Tomorrow\",\n",
       " 'The Elder Scrolls Online',\n",
       " 'Stuntman',\n",
       " 'Battlefield 2 Complete Collection',\n",
       " 'Disgaea 3: Absence of Detention - PlayStation Vita',\n",
       " \"Assassin's Creed III: Liberation\",\n",
       " \"American McGee's Alice - PC\",\n",
       " \"Sid Meier's Alpha Centauri Complete with Alien Crossfire Expansion\",\n",
       " 'Conker: Live & Reloaded - Xbox',\n",
       " \"Conker's Bad Fur Day\",\n",
       " \"Sonic Adventure DX Director's Cut\",\n",
       " 'Star Wars Rogue Squadron II: Rogue Leader',\n",
       " 'Super Monkey Ball 2',\n",
       " 'Skies of Arcadia : Legends',\n",
       " 'Spider-Man',\n",
       " \"Eternal Darkness: Sanity's Requiem\",\n",
       " 'Star Wars: Rebel Strike - Rogue Squadron III',\n",
       " 'Star Wars: Flight of the Falcon',\n",
       " 'GameCube (Jet Black)',\n",
       " 'Lord of the Rings The Return of the King - Gamecube',\n",
       " 'Prince of Persia: Sands of Time',\n",
       " 'Harry Potter Quidditch World Cup',\n",
       " 'Beyond Good & Evil',\n",
       " 'Beyond Good & Evil',\n",
       " 'Enter the Matrix',\n",
       " 'Enter the Matrix',\n",
       " 'Game Boy Player',\n",
       " 'Sega Dreamcast Console',\n",
       " \"World of Warcraft Collector's Editions\",\n",
       " 'Harry Potter & the Chamber of Secrets',\n",
       " 'Spider-Man 2',\n",
       " 'Soul Calibur II - Gamecube',\n",
       " 'Pokemon Leaf Green Version',\n",
       " 'Anachronox - PC',\n",
       " \"Mirror's Edge\",\n",
       " 'Puzzle Quest',\n",
       " 'Puzzle Quest',\n",
       " 'Neverwinter Nights 2 Expansion Pack: Mask of the Betrayer - PC',\n",
       " '.Hack: G.U., Vol. 2 - Reminisce',\n",
       " '.hack: G.U., Vol. 1: Rebirth',\n",
       " 'Super Puzzle Fighter II Turbo',\n",
       " 'Wario Blast',\n",
       " 'Jump Ultimate Stars for Nintendo DS (Japanese Language Import)',\n",
       " \"Tiny Toons: Montana's Movie Madness\",\n",
       " 'Dead or Alive',\n",
       " 'The King of Fighters XIII',\n",
       " 'Metal Gear Solid 4',\n",
       " 'Hyperdimension Neptunia Victory',\n",
       " 'Code of Princess - Nintendo 3DS',\n",
       " 'Pokemon Pinball: Ruby and Sapphire',\n",
       " 'Metal Gear Solid Snake Eater 3D',\n",
       " 'Macross30(Limited Edition)(Japan import)',\n",
       " 'Hyperdimension Neptunia Mk2 - Playstation 3',\n",
       " 'Final Fantasy XIII',\n",
       " 'Final Fantasy XIII',\n",
       " 'Contra: Alien Wars',\n",
       " 'Rhythm Tengoku Gold- DS Game- New Japan Import',\n",
       " 'Wario Land: Super Mario Land 3',\n",
       " 'Castlevania: Lords of Shadow - Mirror of Fate HD',\n",
       " \"Tiny Toon Adventures: Bab's Big Break\",\n",
       " 'World Heroes 2 Jet',\n",
       " 'Battle Arena Toshinden',\n",
       " 'ちびまる子ちゃん おこづかい大作戦!',\n",
       " 'Mega Man Xtreme',\n",
       " 'Banjo-Tooie',\n",
       " 'Castlevania Legends',\n",
       " 'Bomberman GB',\n",
       " 'Okamiden',\n",
       " 'Pokemon, Crystal Version',\n",
       " 'Taiko no Tatsujin DS [Japan Import]',\n",
       " 'Capcom Classics Collection Volume 2',\n",
       " 'Tekken 3D Prime Edition - Nintendo 3DS',\n",
       " 'Donkey Kong 64 - Nintendo 64',\n",
       " 'Drill Dozer',\n",
       " 'Persona 4 Arena',\n",
       " 'Taiko no Tatsujin DS: Dororon! Youkai Daikessen!! [Japan Import]',\n",
       " 'Crayon Shin-Chan (Japanese Import Game) [Game Boy]',\n",
       " 'Jump Super Stars (Japanese Version) - Nintendo DS',\n",
       " 'Parodius Da!, Japanese Game Boy Japan Import',\n",
       " 'Warriors Orochi',\n",
       " 'The Legend of Zelda: Ocarina of Time',\n",
       " 'Legend of Zelda GOLD NES Drinking Flask LEGEND OF DRINK - Nintendo Cartridge Concealed Hip Flask 4.25 ounces - LIMITED EDITION GOLD CART- Nintendo Entertainment Flask - Retro NES Video Game Flask',\n",
       " 'Activision Skylanders Giants Single Character',\n",
       " 'Skylanders SWAP Force Single Character',\n",
       " \"Skylanders Spyro's Adventure: Character Pack\",\n",
       " 'Arcade Legends Sega Genesis 2',\n",
       " 'Activision Skylanders Giants Single Character Pack Core Series 2',\n",
       " 'Pokemon - Red Version',\n",
       " 'Final Fantasy VII',\n",
       " 'Soul Calibur II',\n",
       " 'The Lord of the Rings: The Two Towers',\n",
       " 'Final Fantasy X',\n",
       " 'Dragon Ball Z: The Legacy of Goku II',\n",
       " 'Rocketfish Component Cable for Nintendo Wii',\n",
       " 'World of Warcraft',\n",
       " 'World of Warcraft',\n",
       " 'Gamecube Controller -Purple',\n",
       " 'Resident Evil 5 - PC',\n",
       " 'Dragon Age Origins: Ultimate Edition',\n",
       " 'Nintendo 64 Controller - Green',\n",
       " 'Pokemon HeartGold Version',\n",
       " 'Mass Effect - Xbox 360 (Limited)',\n",
       " 'Dead Space 2',\n",
       " 'Mario Party 7',\n",
       " 'Neverwinter Nights Gold - PC',\n",
       " 'Devil May Cry',\n",
       " 'PlayStation 2 Console w/Progressive Scan DVD Player',\n",
       " 'SOCOM: US Navy Seals',\n",
       " 'Devil May Cry 2',\n",
       " 'Resident Evil 3: Nemesis',\n",
       " 'Xbox Live Starter Kit',\n",
       " 'Songpro for Nintendo Game Boy',\n",
       " 'Car Battler Joe: Game Boy Advance',\n",
       " 'Nintendo GBASHARK GameShark For GameBoy Advance',\n",
       " 'Medabots AX: Rokusho Version (Blue)',\n",
       " 'Lunar 2: Eternal Blue Complete',\n",
       " 'Donkey Kong Country',\n",
       " 'Donkey Kong Country 3',\n",
       " 'Donkey Kong Country 2',\n",
       " 'Donkey Kong Country 2',\n",
       " 'Hearts of Iron 2 - PC',\n",
       " 'Age of Empires 2 Gold',\n",
       " 'Unreal Tournament 2004',\n",
       " 'Lego Indiana Jones: The Original Adventures',\n",
       " 'Lego Indiana Jones: The Original Adventures',\n",
       " 'Animal Crossing: New Leaf',\n",
       " 'Fire Emblem: Awakening',\n",
       " 'Rock Band 2',\n",
       " 'MySims Kingdom - Nintendo 64',\n",
       " '102 Dalmatians: Puppies to the Rescue',\n",
       " 'Mystic Heroes',\n",
       " 'Dragon Age: Origins',\n",
       " 'Dragon Age: Origins',\n",
       " 'Starfox Adventures',\n",
       " 'Starfox Adventures',\n",
       " 'Mass Effect 3',\n",
       " \"Baldur's Gate II: Shadows of Amn\",\n",
       " 'Dragon Quest IV: Chapters of the Chosen - Nintendo DS',\n",
       " 'Bookworm - Nintendo DS',\n",
       " 'SteelSeries Siberia X300 Comfortable Gaming Headset for Xbox One, Xbox 360',\n",
       " 'X-Men: Next Dimension',\n",
       " 'Fable: The Lost Chapters',\n",
       " 'James Bond 007 Everything or Nothing',\n",
       " 'Castlevania: Symphony of the Night',\n",
       " 'LittleBigPlanet 2',\n",
       " 'Left 4 Dead - Nintendo 64',\n",
       " 'Kirby Triple Deluxe - Nintendo 3DS',\n",
       " 'Resident Evil 5',\n",
       " 'Resident Evil 5',\n",
       " 'Pokemon - Blue Version',\n",
       " 'Dr. Mario',\n",
       " 'Final Fantasy Tactics',\n",
       " 'Contra',\n",
       " 'Game Boy Advance SP Classic NES',\n",
       " 'Final Fantasy Tactics: The War of the Lions - Sony PSP',\n",
       " 'Dark Souls 2',\n",
       " 'Dark Souls 2',\n",
       " 'Dark Souls 2',\n",
       " \"Yoshi's Island DS\",\n",
       " 'Catherine',\n",
       " 'Catherine',\n",
       " 'LittleBigPlanet - Playstation 3',\n",
       " 'Nintendo Ac Adapter GameBoy Advance SP',\n",
       " \"Devil May Cry 3: Dante's Awakening\",\n",
       " \"Devil May Cry 3: Dante's Awakening\",\n",
       " 'Shadow of the Colossus',\n",
       " 'Metal Gear Solid: The Essential Collection',\n",
       " 'Contra 4',\n",
       " 'Wild Arms Alter Code F - PlayStation 2',\n",
       " 'Tales of Vesperia',\n",
       " 'Super Smash Brothers',\n",
       " 'Final Fantasy Fables: Chocobo Tales - Nintendo DS',\n",
       " 'The Wolf Among Us',\n",
       " 'Retro Game Challenge - Nintendo DS',\n",
       " 'Metroid Prime 3: Corruption',\n",
       " 'Ratchet & Clank Vita Bundle',\n",
       " 'Resident Evil: Revelations',\n",
       " 'Resident Evil: Revelations',\n",
       " 'Resident Evil: Revelations',\n",
       " 'Boom Blox Bash Party - Nintendo Wii',\n",
       " 'Dynasty Warriors 4',\n",
       " \"Jeanne d'Arc\",\n",
       " 'FINAL FANTASY X X-2 HD Remaster',\n",
       " 'Pokemon Gold',\n",
       " 'Metal Gear Solid HD Collection',\n",
       " 'Super Mario Bros.',\n",
       " 'Mario vs. Donkey Kong 2: March of the Minis',\n",
       " 'Okami',\n",
       " 'Okami',\n",
       " 'Super Mario 3D Land Video Game Accessories',\n",
       " 'Super Mario Advance 4: Super Mario Bros 3',\n",
       " 'South Park:  The Stick of Truth',\n",
       " 'Lego Star Wars',\n",
       " 'The Legend of Zelda: A Link Between Worlds 3D Twister Parent',\n",
       " 'Xenosaga Episode III - PlayStation 2',\n",
       " 'Grandia 2',\n",
       " 'Resident Evil 4',\n",
       " 'Mega Man X Collection - PlayStation 2',\n",
       " 'BlazBlue: Continuum Shift',\n",
       " 'Kids Starter Bundle for Nintendo Wii',\n",
       " 'Prince of Persia: The Two Thrones',\n",
       " 'Metal Gear Solid 2: Sons of Liberty',\n",
       " 'Metal Gear Solid 2: Sons of Liberty',\n",
       " 'Super Mario Bros. - Classic NES Series',\n",
       " 'Bloodborne',\n",
       " 'Bravely Default - Nintendo 3DS',\n",
       " 'Animal Crossing: Wild World',\n",
       " 'Super Metroid',\n",
       " 'Dragon Quest V: Hand of the Heavenly Bride - Nintendo DS',\n",
       " 'New Super Mario Bros',\n",
       " \"Uncharted 3: Drake's Deception\",\n",
       " 'Tetris & Dr. Mario - 2 Game Cartridge',\n",
       " 'Lunar II: Eternal Blue for Sega CD',\n",
       " 'Disgaea DS',\n",
       " 'Grandia Xtreme',\n",
       " 'Disgaea: Hour of Darkness (Greatest Hits)',\n",
       " 'The Last Story - Nintendo Wii',\n",
       " 'Tactics Ogre: Let Us Cling Together - Sony PSP',\n",
       " 'Super C',\n",
       " 'Castlevania: Portrait of Ruin',\n",
       " 'Castlevania: Dawn of Sorrow',\n",
       " 'Valkyria Chronicles',\n",
       " 'Boom Blox - Nintendo Wii',\n",
       " 'Lunar Knights: Vampire Hunters - Nintendo DS',\n",
       " \"Metroid Prime Trilogy: Collector's Edition\",\n",
       " 'The Last of Us',\n",
       " 'Soul Calibur - Sega Dreamcast',\n",
       " 'Super Mario 3D Land',\n",
       " 'Nintendo 2DS - Electric Blue',\n",
       " 'Rayman Origins',\n",
       " 'Rayman Origins',\n",
       " 'Mega Man Zero 3',\n",
       " 'Ratchet & Clank Going Commando',\n",
       " \"Final Fantasy Anthology: Collector's Package\",\n",
       " 'Mega Man Powered Up - Sony PSP',\n",
       " \"Uncharted 3: Drake'S Deception Game Of The Year Digital Edition\",\n",
       " 'Mega Man Zero 2',\n",
       " 'Vagrant Story',\n",
       " 'Castlevania: Aria of Sorrow',\n",
       " 'Disgaea: Afternoon of Darkness',\n",
       " 'Sports Starter Bundle for Nintendo Wii',\n",
       " 'Metal Gear Solid: The Legacy Collection',\n",
       " 'Dead Space',\n",
       " \"Uncharted: Drake's Fortune - Playstation 3\",\n",
       " 'PlayStation 2 Starter Pack',\n",
       " 'Tales of Xillia',\n",
       " 'Metroid',\n",
       " 'Castlevania: Order of Ecclesia',\n",
       " '3D Dot Game Heroes - Playstation 3',\n",
       " 'Batman: Arkham Asylum',\n",
       " 'BioShock Infinite',\n",
       " 'The Legend of Zelda: Twilight Princess',\n",
       " 'The Legend of Zelda: Twilight Princess',\n",
       " 'Rayman Legends',\n",
       " 'Rayman Legends',\n",
       " 'Batman Arkham City',\n",
       " 'Nintendo 3DS Portable Gaming Console - Purple',\n",
       " 'Uncharted: Greatest Hits Dual-Pack',\n",
       " 'Kingdom Hearts',\n",
       " 'Super Mario Galaxy (Nintendo Selects)',\n",
       " 'Metal Gear Solid 4: Guns of the Patriots',\n",
       " 'Pokemon: Yellow Version - Special Pikachu Edition',\n",
       " 'Lunar Silver Star Story Complete',\n",
       " 'Suikoden V - PlayStation 2',\n",
       " 'Super Smash Bros. Brawl',\n",
       " 'Super Mario Land',\n",
       " 'Blast Works: Build, Trade, Destroy - Nintendo Wii',\n",
       " 'Excitebike: Classic NES Series',\n",
       " 'Nintendo DS Lite Bundle [Older Versions and Bundles]',\n",
       " 'Wild Arms 3 - PlayStation 2',\n",
       " 'Hotel Dusk: Room 215',\n",
       " 'Tales of the Abyss - PlayStation 2',\n",
       " 'Tales of Legendia - PlayStation 2',\n",
       " 'Pokemon Y',\n",
       " 'Intelligent Qube - PlayStation',\n",
       " 'Gunstar Heroes',\n",
       " 'Mega Man 2 - Nintendo NES',\n",
       " 'Super Mario Galaxy',\n",
       " 'Kingdom Hearts II - PlayStation 2',\n",
       " 'BioShock',\n",
       " 'Dark Souls',\n",
       " 'Star Ocean: The Last Hope International - Playstation 3',\n",
       " 'Bleach: Soul Resurreccion - Playstation 3',\n",
       " \"Dragon's Dogma\",\n",
       " \"King's Field: The Ancient City\",\n",
       " 'Sneak King',\n",
       " 'Two Worlds',\n",
       " 'Legacy of Kain: Soul Reaver',\n",
       " 'Rogue Ops',\n",
       " 'Arc the Lad Twilight of the Spirits - PlayStation 2',\n",
       " 'Yu-Gi-Oh! Duelists of the Roses',\n",
       " 'Dynasty Warriors 5',\n",
       " 'Rygar',\n",
       " 'SNES/NES FC Twin Video Game System',\n",
       " 'NES/SNES/GENESIS 3 IN 1 AC ADAPTER',\n",
       " 'Sega Game Gear  Rechargeable Battery Pack',\n",
       " \"The Legend of Zelda: Collector's Edition (Zelda / Zelda II: The Adventure of Link / Ocarina of Time / Majora's Mask)\",\n",
       " 'Gamecube Black Controller',\n",
       " 'Namco Museum 50th Anniversary',\n",
       " 'Game Boy Advance Console in Glacier',\n",
       " 'Super Mario All Stars',\n",
       " 'GameShark Pro',\n",
       " 'Gba Replacement Battery Cover',\n",
       " 'Game Boy Advance/sp Ar Action Replay',\n",
       " 'Sony PlayStation Video Game Console',\n",
       " 'Ignition Factor - Nintendo Super NES',\n",
       " 'Gameboy Advance SP',\n",
       " 'Gameboy Advance SP',\n",
       " 'Gameboy Advance SP',\n",
       " 'Grand Theft Auto: San Andreas',\n",
       " 'GameCube Action Replay',\n",
       " \"Milon's Secret Castle\",\n",
       " \"Tony Hawks' Pro Skater 3\",\n",
       " 'Retro-bit Nintendo 64 Booster Pack (Jumper Pak)',\n",
       " 'Energizer 3x Charge Station for Wii U',\n",
       " 'RS-8, 8-Bit Retro 2.5\" LCD 168x Video Games Portable Handheld Console (BLUE+BLACK) - NEW!',\n",
       " 'Castlevania',\n",
       " 'Steel 3.8mm Security Bit Screwdriver Tool (7cm Length) Open Cartridges for Original Nintendo (NES), Super Nintendo (SNES), Nintendo 64 (N64), Virtual Boy, Original Game Boy, Game Boy Color, and Sega Game Gear',\n",
       " 'Datel Action Replay Max Duo for GBA & DS Consoles',\n",
       " 'Bases Loaded',\n",
       " 'Bases Loaded',\n",
       " 'NES Advantage Joystick',\n",
       " 'Game Genie - Sega Game Gear',\n",
       " 'Pinball Hall of Fame: The Williams Collection',\n",
       " 'Midway Arcade Treasures',\n",
       " 'Pinball Hall of Fame The Gottlieb Collection',\n",
       " 'The Legend of Zelda: A Link to the Past',\n",
       " 'Generic Black Remote and Nunchuck Set Combo for Nintendo Wii [Nintendo Wii]',\n",
       " 'Authentic Nintendo 64 N64 Console Replacement part Memory Expansion Bay Cover Jumper Pak Door',\n",
       " 'Tomee NES USB Controller for PC/Mac',\n",
       " 'Hyperkin Game Boy Advance Battery Cover - Orange (Free HandHelditems Sketch Universal Stylus Pen)',\n",
       " 'Bases Loaded II - Nintendo NES',\n",
       " 'Doremi Fantasy: Milon no DokiDoki Daibouken, Super Famicom (Super NES Japanese Import)',\n",
       " 'Super Mario Bros. 2',\n",
       " 'Grand Theft Auto: Vice City',\n",
       " 'Gameboy Advance Sp- Limited Edition Spongebob Squarepants',\n",
       " 'Sandisk 4GB SDHC for Nintendo DSi',\n",
       " 'Crystal Mines II (Atari Lynx)',\n",
       " 'Harvest Moon - Nintendo Super NES',\n",
       " 'Harvest Moon Back to Nature',\n",
       " 'Nintendo Wii Console',\n",
       " 'Sega Genesis Collection',\n",
       " 'Hyperkin Retron 3 Video Game System for NES/SNES/GENESIS - Red',\n",
       " 'Nintendo DS Lite',\n",
       " 'Battery Pack (Atari Lynx)',\n",
       " 'HORI Screen Protective Filter for Nintendo NEW 3DS XL',\n",
       " 'Harvest Moon: Island of Happiness',\n",
       " 'Game Genie Video Game Enhancer',\n",
       " 'Game Genie Video Game Enhancer',\n",
       " 'CASTLEVANIA DRACULA DENSETSU II NINTENDO GAME BOY JAPAN Import',\n",
       " 'Xbox Core Console USM',\n",
       " 'Taito Legends',\n",
       " 'Q*bert',\n",
       " 'Mole Mania',\n",
       " 'Animal Crossing',\n",
       " 'Tecmo Classic Arcade - Xbox',\n",
       " 'GAME SHARK VIDEO GAME ENHANCER for Game Boy Color and Game Boy Pocket',\n",
       " 'Wii Classic Controller Pro',\n",
       " 'Mighty Bomb Jack',\n",
       " 'Gameboy Advance SP- Charcoal',\n",
       " 'Gameboy Advance SP GameShark Game Codes',\n",
       " \"Shepherd's Crossing 2 - Nintendo DS\",\n",
       " 'Sega Genesis AtGames Classic Game Console 2013',\n",
       " 'Namco Museum - PlayStation 2',\n",
       " 'Sony PlayStation Portable 2001',\n",
       " 'Fire N Ice - Nintendo NES',\n",
       " 'True Crime: Streets of L.A.',\n",
       " 'Super Pad 8',\n",
       " 'Datel Action Replay for Nintendo DSI/LITE/DS/XL (Latest version inc Black/White Pokemon updates)',\n",
       " \"Demon's Crest\",\n",
       " \"The Legend of Zelda: Ocarina of Time  (Collector's Edition)\",\n",
       " 'Nintendo DSi',\n",
       " 'Akumajo Dracula X: Chi no Rondo [Japan Import]',\n",
       " 'Nintendo GAMECUBE Game Boy Advance Cable - Game console link cable',\n",
       " 'Nintendo Entertainment System',\n",
       " 'Midway Arcade Treasures 2 - Gamecube',\n",
       " 'Sega Genesis Core System 2 - Video Game Console',\n",
       " \"The Legend of Zelda: Link's Awakening\",\n",
       " 'Transformers: Cybertron Adventures',\n",
       " \"Asura's Wrath\",\n",
       " 'R-Type Final',\n",
       " 'Devil May Cry Collection',\n",
       " 'Yaniba: Ninja Gaiden Z',\n",
       " 'Otomedius Excellent',\n",
       " 'God of War 2 - PlayStation 2',\n",
       " 'Star Wars: Starfighter',\n",
       " 'Star Trek Encounters - PlayStation 2',\n",
       " 'Ace Combat Zero: The Belkan War',\n",
       " 'Star Wars Episode III Revenge of the Sith - PlayStation 2',\n",
       " 'Star Trek: Conquest',\n",
       " 'Wii Sports',\n",
       " 'Star Wars Battlefront - PlayStation 2',\n",
       " 'Blood Rayne 2',\n",
       " 'Star Wars: Jedi Starfighter',\n",
       " 'Star Wars Bounty Hunter - PlayStation 2',\n",
       " 'Final Fantasy VII: Dirge of Cerberus',\n",
       " 'Crisis Core: Final Fantasy VII',\n",
       " 'Naruto Ultimate Ninja: Storm',\n",
       " 'The World Ends With You',\n",
       " 'Final Fantasy XIII-2',\n",
       " 'Final Fantasy XIII-2',\n",
       " 'Castlevania: Curse of Darkness',\n",
       " 'NieR Replicant (Ultimate Hits) [Japan Import]',\n",
       " 'Naruto: Ultimate Ninja Storm 2',\n",
       " 'Bleach Heat the Soul 6',\n",
       " 'Castlevania: Lords of Shadow',\n",
       " 'Castlevania: Lords of Shadow',\n",
       " 'Castlevania: Lords of Shadow',\n",
       " 'NIER',\n",
       " 'Naruto Shipuden: Ultimate Ninja Heroes 3 - Sony PSP',\n",
       " 'Final Fantasy XII',\n",
       " \"Baldur's Gate: Dark Alliance 2\",\n",
       " 'Shin Megami Tensei Digital Devil Saga 2 - PlayStation 2',\n",
       " 'Rogue Galaxy - PlayStation 2',\n",
       " 'Buffy the Vampire Slayer: Chaos Bleeds',\n",
       " 'Final Fantasy Origins Final Fantasy I & II Remastered Editions - PlayStation',\n",
       " '.hack: G.U., Vol.3: Redemption',\n",
       " 'Shadow Hearts: Covenant',\n",
       " \"Assassin's Creed\",\n",
       " 'Folklore - Playstation 3',\n",
       " 'Shadow Hearts: From the New World - PlayStation 2',\n",
       " 'Shin Megami Tensei: Persona 3 - PlayStation 2',\n",
       " '.hack, Part 2: Mutation',\n",
       " 'Assassins Creed II',\n",
       " 'Assassins Creed II',\n",
       " 'The Elder Scrolls 3: Morrowind',\n",
       " 'Shin Megami Tensei Nocturne',\n",
       " 'Myst 3: Exile',\n",
       " 'Myst 3: Exile',\n",
       " 'Prince of Persia: The Sands of Time',\n",
       " 'Nintendo 3DS XL Gold/Black - Limited Edition Bundle with The Legend of Zelda: A Link Between Worlds',\n",
       " 'Rez [Special Package w/ Trance Vibrator] [Japan Import]',\n",
       " 'Action Reply',\n",
       " 'Pac-Man World 2',\n",
       " 'Viewtiful Joe - Gamecube',\n",
       " 'Doom 3',\n",
       " 'Metal Gear Solid: The Twin Snakes',\n",
       " 'Fighting Force',\n",
       " 'Nintendo NES System - Video Game Console',\n",
       " 'Super Nintendo Controller',\n",
       " 'Sega Genesis Game Controller Model #1650',\n",
       " 'Sonic the Hedgehog 2',\n",
       " 'Security Bit Steel SET 3.8mm + 4.5mm Security Bit Screwdriver Tool (7cm Length) Open NES SNES N64 Super Nintendo 64 Cartridges & Systems',\n",
       " 'Super Castlevania IV',\n",
       " 'Lara Croft Tomb Raider: The  Angel Of Darkness',\n",
       " 'Harvey Birdman: Attorney at Law',\n",
       " 'ultimate spider-man',\n",
       " 'SpongeBob Squarepants: Revenge of the Flying Dutchman',\n",
       " 'The Getaway: Black Monday - PlayStation 2',\n",
       " '50 Cent: Bulletproof',\n",
       " 'Aqua Teen Hunger Force: Zombie Ninja Pro-Am - PlayStation 2',\n",
       " \"Sonic's Ultimate Genesis Collection\",\n",
       " \"WWE '12\",\n",
       " 'Family Guy: Back to the Multiverse',\n",
       " 'Harry Potter and the Deathly Hallows Part 1',\n",
       " 'Harry Potter and the Deathly Hallows Part 1',\n",
       " 'Harry Potter and the Deathly Hallows Part 1',\n",
       " 'Star Fox Command',\n",
       " 'Harry Potter and the Half Blood Prince - Nintendo 64',\n",
       " 'Harry Potter and the Half Blood Prince - Nintendo 64',\n",
       " 'Nintendo 64 System',\n",
       " 'Star Wars Knights of the Old Republic II: The Sith Lords',\n",
       " 'Excitebike',\n",
       " \"Assassin's Creed 4\",\n",
       " 'The Legend of Zelda Skyward Sword',\n",
       " \"Gargoyle's Quest\",\n",
       " 'Nintendo 3DS Aqua Blue',\n",
       " 'Resident Evil: The Mercenaries 3D',\n",
       " 'Sonic Unleashed',\n",
       " 'Star Wars Episode 1: Battle for Naboo',\n",
       " 'Blaster Master: Enemy Below',\n",
       " 'Heroes Of Mana - Nintendo DS',\n",
       " 'Bad Dudes - Nintendo NES',\n",
       " 'Teenage Mutant Ninja Turtles',\n",
       " 'Teenage Mutant Ninja Turtles',\n",
       " 'Indiana Jones and the Staff of Kings',\n",
       " 'Final Fantasy:  Crystal Chronicles - Gamecube',\n",
       " 'Castlevania: Legacy of Darkness',\n",
       " 'Catwoman - Gamecube',\n",
       " 'Tales Of Symphonia: Dawn of the New World',\n",
       " 'Indiana Jones and the Infernal Machine',\n",
       " 'ZombiU - Nintendo Wii U',\n",
       " 'Kid Niki Radical Ninja',\n",
       " 'Duck Tales 2',\n",
       " 'Final Fantasy XIV - GAMEPLAY ACCESS NO LONGER AVAILABLE',\n",
       " 'Metal Gear Solid 3 Snake Eater - PlayStation 2',\n",
       " 'Star Wars Episode I: Jedi Power Battles',\n",
       " 'LEGO Harry Potter: Years 1-4',\n",
       " 'Bond 007: Quantum of Solace',\n",
       " 'Bond 007: Quantum of Solace',\n",
       " 'Contra Force',\n",
       " 'Blaster Master 2 - Sega Genesis',\n",
       " 'Castlevania: Dracula X',\n",
       " 'New Super Mario Bros. Wii',\n",
       " 'Mighty Morphin Power Rangers',\n",
       " 'Final Fantasy: The 4 Heroes of Light',\n",
       " 'Harry Potter and the Order of the Phoenix',\n",
       " 'Harry Potter and the Order of the Phoenix',\n",
       " 'Harry Potter and the Order of the Phoenix',\n",
       " 'The Legend of Zelda: Skyward Sword',\n",
       " 'Nintendo 64 Mario Kart Video Game',\n",
       " 'Tenchu: Shadow Assassins - Nintendo Wii',\n",
       " 'CHOJIN JETMAN FAMICOM NES FC JP',\n",
       " 'Harry Potter and The Deathly Hallows Part 2',\n",
       " 'Harry Potter and The Deathly Hallows Part 2',\n",
       " 'Harry Potter and The Deathly Hallows Part 2',\n",
       " \"Luigi's Mansion - Gamecube\",\n",
       " 'X-men: The Official Game',\n",
       " 'Drakkhen',\n",
       " 'Mighty Morphin Power Rangers: The Fighting Edition',\n",
       " 'Battlefield 2 Modern Combat',\n",
       " 'Star Wars Episode II: Attack of the Clones',\n",
       " 'Contra: Shattered Soldier',\n",
       " 'Fable III',\n",
       " 'Kirby and the Amazing Mirror',\n",
       " '007 The World is Not Enough',\n",
       " 'Mega Man X5',\n",
       " 'Robocop',\n",
       " 'Harry Potter and the Goblet of Fire',\n",
       " 'Resident Evil: The Darkside Chronicles',\n",
       " 'Castlevania Judgment',\n",
       " 'Teenage Mutant Ninja Turtles: Smash-Up',\n",
       " 'Unlimited Saga - PlayStation 2',\n",
       " 'James Bond 007 From Russia With Love - Gamecube',\n",
       " \"Castlevania II: Simon's Quest\",\n",
       " \"Castlevania II: Simon's Quest\",\n",
       " '007 Racing',\n",
       " 'Kirby Air Ride',\n",
       " \"Assassin's Creed III\",\n",
       " 'Turok 2: Seeds of Evil',\n",
       " 'Power Rangers Battle Racers',\n",
       " \"Kirby's Return to Dream Land\",\n",
       " 'Batman Begins',\n",
       " 'Star Fox Assault',\n",
       " 'Quest 64',\n",
       " 'Tecmo Secret of the Stars',\n",
       " 'The Castlevania Adventure',\n",
       " 'Charlie & The Chocolate Factory - PC',\n",
       " 'Lufia: Curse of the Sinistrals - Nintendo DS',\n",
       " 'Super Paper Mario',\n",
       " \"Pandora's Tower - Nintendo Wii\",\n",
       " \"Dante's Inferno\",\n",
       " 'Kirby 64: The Crystal Shards',\n",
       " 'Chrono Cross - PlayStation',\n",
       " 'The Legend of Zelda: Skyward Sword Gold Remote Bundle',\n",
       " 'Marvel Nemesis: Rise of the Imperfects - Gamecube',\n",
       " 'Final Fantasy Crystal Chronicles: The Crystal Bearers',\n",
       " 'Goldeneye Rogue Agent',\n",
       " 'Castlevania Double Pack: Aria of Sorrow / Harmony of Dissonance',\n",
       " 'Street Fighter 2010: The Final Fight',\n",
       " 'Metroid: Other M',\n",
       " 'Super Mario Sunshine',\n",
       " 'James Bond 007: Nightfire',\n",
       " 'James Bond 007: Nightfire',\n",
       " 'Mega Man X4',\n",
       " 'Sword Of Mana',\n",
       " 'Charlie and the Chocolate Factory - Gamecube',\n",
       " 'Nintendo 64 System - Video Game Console',\n",
       " 'Call of Duty 4: Modern Warfare',\n",
       " 'Mario Party 4',\n",
       " 'Romancing SaGa - PlayStation 2',\n",
       " 'Final Fantasy Crystal Chronicles: Echoes of Time',\n",
       " 'Final Fantasy Crystal Chronicles: Echoes of Time',\n",
       " 'Resident Evil: The Umbrella Chronicles',\n",
       " 'Starfox Command',\n",
       " 'Sonic and the Secret Rings - Nintendo Wii',\n",
       " 'Tomorrow Never Dies - PlayStation',\n",
       " 'James Bond 007: From Russia With Love',\n",
       " 'Mega Man X3',\n",
       " \"Yoshi's Safari\",\n",
       " 'Super Princess Peach',\n",
       " 'Breath of Fire: Dragon Quarter - PlayStation 2',\n",
       " 'Super Paper Mario (Nintendo Selects)',\n",
       " 'James Bond 007: GoldenEye - Nintendo Wii',\n",
       " 'Metroid Prime 2: Echoes',\n",
       " 'Aerofighters Assault - Nintendo 64',\n",
       " \"NES Castlevania Trilogy - Castlevania, Castlevania II: Simon's Quest, Castlevania III: Dracula's Curse\",\n",
       " \"Gargoyle's Quest II - Nintendo NES\",\n",
       " 'Children of Mana',\n",
       " 'Paper Mario: Sticker Star',\n",
       " 'Resident Evil Code Veronica',\n",
       " 'Resident Evil Code Veronica',\n",
       " 'Spider-Man 3',\n",
       " 'Actraiser II - Nintendo Super NES',\n",
       " 'The Matrix: Path of Neo',\n",
       " 'The Legend of Zelda: Twilight Princess (Nintendo Selects)',\n",
       " 'Pocky & Rocky',\n",
       " 'Die Hard Vendetta',\n",
       " 'Star Wars Episode 1: The Phantom Menace - PC',\n",
       " 'Resident Evil 3 Nemesis',\n",
       " 'Resident Evil 2',\n",
       " 'Silent Hill 2 - PC',\n",
       " 'Call Of Duty 3',\n",
       " 'Parasite Eve',\n",
       " 'Manhunt',\n",
       " 'ESPN NFL 2K5',\n",
       " 'Killzone - PlayStation 2',\n",
       " 'Silent Hill 3',\n",
       " 'Resident Evil: Outbreak',\n",
       " 'Painkiller - PC',\n",
       " 'Dino Crisis 3',\n",
       " 'Kya: Dark Lineage',\n",
       " \"Indiana Jones and the Emperor's Tomb\",\n",
       " 'Microsoft Xbox - Game console - 8 GB - black',\n",
       " 'Virtua Fighter 4 Evolution - PlayStation 2',\n",
       " 'Legend Of Legaia',\n",
       " 'Monopoly Party',\n",
       " 'Scooby Doo! First Frights',\n",
       " 'Nyko Charge Station Quad for Wii (Black)',\n",
       " 'Gen PS2 Wireless Controller 2.4G',\n",
       " 'Gator Crunch PSP 3000 7 Items Accessory Bundle (Bulk Packaging)',\n",
       " 'Cake Mania NDS',\n",
       " 'Mega Man X Command Mission - Gamecube',\n",
       " 'Mega Man Legends',\n",
       " 'Bloody Roar: Primal Fury',\n",
       " \"Nintendo DS Lite Pro Gamer's Kit (Colors May Vary)\",\n",
       " 'Scripps Spelling Bee - Nintendo DS',\n",
       " 'Monster Rancher 4',\n",
       " 'HDE Sony PS3 Controller Skin Silicone Grip Cover Case for Playstation 3 Dualshock Wireless Game Controllers',\n",
       " \"DeusEx Human Revolution Director's Cut\",\n",
       " 'Sonic and All-Stars Racing Transformed Bonus Edition',\n",
       " 'Project X Zone - Nintendo 3DS',\n",
       " 'Spirit Camera: The Cursed Memoir - Nintendo 3DS',\n",
       " 'Nintendo Wii Remote Plus',\n",
       " 'Ys: Memories of Celceta',\n",
       " \"Adventure Time: Explore the Dungeon Because I DON'T KNOW!\",\n",
       " ...]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "recommend_products('c38752775') # This user reviewed a lot of games"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
